[{"country":"Algeria","conflictType":"Complex","began":"1991.33","ended":"2004.92","eventDescription":"Efforts by ruling FLN (National Liberation Front) to ensure its electoral success through legislative gerrymandering trigger mass protests. Military increases its political influence in Salvation Front wins elections, government cancels results (ARC 1/92). Islamic militants and military-government initiate effort to prevent election of Islamicists. When Islamic intense terror campaigns designed to undermine each other's support bases (REV 5/91-12/04).","duration":"13.59","countryCode":"algeria"},{"country":"Angola","conflictType":"Complex","began":"1975.00","ended":"2002.17","eventDescription":"Post-independence civil war between Mbundu-dominated central government, Bakongo and Cabindan rebels, and UNITA (Union for the Total Independence of Angola), based on Ovimbundu people of south Angola (ETH 1/75-3/02, REV 1/75- 3/02). Both UNITA rebels and government forces perpetrate destructive campaigns and atrocities against civilians throughout conflict (GEN 11/75-11/94). Internationally brokered peace plan leads to multi-party elections but UNITA's Savimbi rejects results and establishes rival government in Huambo (ARC 5/92-4/97). 1994 Lusaka protocol ends conflict for a short time but intense fighting erupts again in late 1998. Targeting of civilian populations resumes with the break down to civil war (GEN 12/98-3/02). Death of UNITA leader, Jonas Savimbi, in February 2002 is followed by a cessation of fighting in March and the signing of a new peace agreement in August 2002.","duration":"27.17","countryCode":"angola"},{"country":"Benin","conflictType":"Regime Change","began":"1963.75","ended":"1965.92","eventDescription":"Labor and ethnic tensions undermine fragile democracy. In attempt to quell political instability, military intervenes twice before finally abolishing democratic institutions and institutionalizing military rule.","duration":"2.17","countryCode":"benin"},{"country":"Benin","conflictType":"Regime Change","began":"1972.75","ended":"1972.75","eventDescription":"Regional rivalries force military to transfer power to civilian government. Ethnically diverse civilian coalition falls in second successful coup in three years and a Marxist-Leninist state is proclaimed.","duration":"0.00","countryCode":"benin"},{"country":"Burkina Faso","conflictType":"Regime Change","began":"1980.83","ended":"1980.83","eventDescription":"Leader of former military regime, President Lamizana, elected as head of civilian government. Subsequent economic crisis and labor unrest triggers military coup and suspension of Constitution.","duration":"0.00","countryCode":"burkinafaso"},{"country":"Burundi","conflictType":"Complex","began":"1963.42","ended":"1973.92","eventDescription":"Unstable political alliance between Tutsis and Hutus produces democratic stalemate. King increases his authority but is unable to resolve ethnic tensions and is overthrown by the by  Hutu units in 1965 results in massacres of Tutsis in countryside, prompting Army to eliminate Hutu leaders, and in Tutsi-dominated military (ARC 6/63-11/ 66). Attempted coup 1972 Hutus insurgents launch a coordinated attack against government authorities in the south and east (ETH 4/72-7/72). Challenges to Tutsi-dominated government by ethnic-Hutus results in ethnic massacres (GEN 10/65-12/73).","duration":"10.50","countryCode":"burundi"},{"country":"Burundi","conflictType":"Complex","began":"1988.58","ended":"2005.33","eventDescription":"Attempted democratic reforms prompt violence between historically dominant Tutsis and Hutu challengers (ETH 8/88-5/05). As result of rural violence against local Tutsi officials, Tutsi-dominated army conducts unpremeditated massacres of Hutus (GEN 8/88). In 1993, Hutu opposition forces win first multi-party presidential and legislative elections, provoking disaffected Tutsi military forces to revolt and assassinate the Hutu president (ARC 10/93-7/96). Subsequent armed clashes and massacres occur in three waves: Tutsi soldiers against Hutu civilians, Hutus against Tutsis, and Tutsi against Hutus (GEN 10/93-12/93). Arusha peace accords are signed by all parties except the FNL in July 2001 and establish an interim government. Most fighting has ended by May 2005 and elections are held that set up a power-sharing government.","duration":"16.75","countryCode":"burundi"},{"country":"Burundi","conflictType":"Regime Change","began":"2015.50","ended":"2015.50","eventDescription":"The ruling CNDD-FDD party announced on 25 April 2015 that they were naming President Pierre Nkurunziza as their candidate for scheduled presidential elections and despite a low turnout, the incumbent was re-elected. Most opposition parties reject the outcome and violence persists in the constitutional two-term limit, triggering widespread protests and a 13 May 2015 coup attempt. The government proceeded with the controversial election and, despite an opposition boycott aftermath.","duration":"0.00","countryCode":"burundi"},{"country":"Central African Republic","conflictType":"Complex","began":"2003.17","ended":"ONGOING","eventDescription":"Following his dismissal as commander, troops loyal to Gen. Bozize mount challenge to elected government of President Patasse. Gen. Bozize succeeds in seizing power in March 2003 while Patasse is out of the country (ARC 3/03). Supporters of ousted President Patasse in the north face retribution from the Bozize regime which draws its support from southerners. Open rebellion breaks out in the northwest in June 2005 and, then, in October 2006 in the northeast (ETH 6/05-2/13). In December 2012, Islamist militant groups form a coalition called Seleka and begin to seize territories in the northeast (ETH from 12/12). Despite a peace agreement in February 2013, Seleka rebels forcibly oust the Bozize regime (ARC from 3/13) but are unable or unwilling to assert central authority and, instead, engage in predatory actions. Christian \"anti-balaka\" militias form in response and attempt to oust the Seleka rebels from the capital in December 2013. The Seleka rebels withdraw but \"anti-balaka\" militias systematically target Muslim communities for retribution (GEN from 12/13).","duration":"13.83","countryCode":"centralafrican"},{"country":"Chad","conflictType":"Complex","began":"1965.75","ended":"1994.75","eventDescription":"Recurring civil war among Chad's many communal groups with shifting alliances, but mainly along north-south lines (ETH 10/65-10/94). Failed attempt at national unification in 1978 leads to collapse of governance, intensified conflict, and international intervention (ARC 2/79-6/84).","duration":"29.00","countryCode":"chad"},{"country":"Chad","conflictType":"Revolutionary War","began":"2005.75","ended":"2010.25","eventDescription":"Dominance of the central government by President D'by's clan and ethnic-Zaghawa supporters led to a mutiny byelements of the army in October 2005, a coup attempt in March 2006, and an attack on the capital in April 2006. Failing tounseat the government, FUC rebel forces took refuge in border regions with Sudan and Central African Republic. A peace agreement with the rebels was reached in December 2006 and fighting largely ended in January 2007. The agreement quickly broke down and fighting resumed in areas bordering the Sudan; this round included a split in Déby's support base. A second attack on the capital was mounted in February 2008 but this attack also failed to unseat the D'by government. An agreement was reached between Chad and Sudan in late 2009 to normalize relations and cooperate in increasing security along their mutual border; armed clashes subsequently have diminished on both sides of the border.","duration":"4.50","countryCode":"chad"},{"country":"Republic of the Congo","conflictType":"Regime Change","began":"1963.92","ended":"1963.92","eventDescription":"Fragile democracy weakened by ethnic and labor tensions. Military forces President Youlou to resign. Interim government established prior to popular approval of new constitution that creates one-party Marxist-Leninist state.","duration":"0.00","countryCode":"republicof"},{"country":"Republic of the Congo","conflictType":"Complex","began":"1997.42","ended":"1999.92","eventDescription":"Civil war erupts amid pre-election tensions when President Lissouba's army attacks the residence of former dictator 1999. Pointe Noire Peace Agreement ends fighting in December 1999 (REV 6/97-12/99). Transition to democracy endswhen Sassou-Nguesso rallies supporters, backed by Angolan Troops, and ousts Lissouba (ARC 10/97).","duration":"2.50","countryCode":"republicof"},{"country":"Democratic Republic of the Congo","conflictType":"Complex","began":"1960.42","ended":"1965.83","eventDescription":"Independence is followed by intense political and tribal factionalism and the emergence of secessionist movements. Failed attempt at democracy ends in establishment of military dictatorship under General Mobutu (ARC 6/60-11/65). Mutiny within ranks of military escalates into full-scale civil war. Rebels expel remnants of Belgian colonial apparatus (REV7/60-8/65). Katanga and South Kasai secede from newly independent Congo (1960) followed by secession of Orientale and Kivu (1961) and rebellions in Stanleyville and Kwilu (1964) (ETH 7/60-11/65). To consolidate control, rebels massacre counter-revolutionaries, including educated Congolese, missionaries, and other Europeans (GEN 2/64-1/65).","duration":"5.41","countryCode":"democraticrepublic"},{"country":"Democratic Republic of the Congo","conflictType":"Complex","began":"1977.17","ended":"1979.92","eventDescription":"Independence movement of Lunda/Yeke (FNLC--Zaire National Liberation Front) invades Shaba (Katanga) Province, their traditional homeland (ETH 3/77-5/78). Episodic rebellions and agitation are countered by killings of political opponents, dissident tribesmen, and prisoners (GEN 3/77-12/79)","duration":"2.75","countryCode":"democraticrepublic"},{"country":"Democratic Republic of the Congo","conflictType":"Complex","began":"1992.17","ended":"ONGOING","eventDescription":"Communal violence erupts in Shaba (Katanga) between Luba-Kasai minority and dominant Lunda; regional governments become more autonomous (ETH from 3/92). In reaction to absolute power wielded by Mobutu's military-backed government, pro-democracy opposition pressures him to appoint new prime minister and government (ARC 12/92-7/03).Tutsis residing in eastern Zaire form core of rebel army that, with substantial help from Rwanda, defeats government troops and ousts Mobutu's regime (REV 10/96-7/03). Disaffection with the policies of the nascent Kabila regime leads tothe polarization of ethnic-militias, failure of central authority, and the widening of the conflict to include armed forces from regional states. Power-sharing agreement reestablishes central authority in July 2003 and integrates key militias inthe central army but sporadic, ethnic armed conflict continues in outlying regions, especially the north and east.","duration":"24.83","countryCode":"democraticrepublic"},{"country":"Djibouti","conflictType":"Ethnic War","began":"1991.83","ended":"1994.42","eventDescription":"A rebellion led by the Front for the Restoration of Unity and Democracy (FRUD), comprised mainly of ethnic-Afars, breaks out in November 1991. Government offensive in July 1993, supported by French forces, recaptures much of the territory controlled by rebels. Negotiations lead to recognition of FRUD as a legitimate party and an end to the fighting inJune 1994. A formal peace agreement is concluded in December 1994. FRUD registered as a political party in March 1996; militant splinter group continues sporadic violence through 1999.","duration":"2.59","countryCode":"djibouti"},{"country":"Egypt","conflictType":"Revolutionary War","began":"1992.08","ended":"1999.17","eventDescription":"Terror campaign by militant Islamic groups against secular government; largely suppressed by mid-1996. Widespread arrests of activists result in March 1999 renunciation of violence by the Gamaat-I-Islamiya (Egypt's largest resistance group).","duration":"7.09","countryCode":"egypt"},{"country":"Egypt","conflictType":"Revolutionary War","began":"2011.00","ended":"ONGOING","eventDescription":"Inspired by popular protests in Tunisia, Egyptian liberal and Islamist activists hold mass demonstrations against the Mubarak regime and are met with lethal repression. The protests lead to Mubarak's resignation on 11 February 2011 and initiate a democratic transition; presidential elections result in a victory for Muslim Brotherhood candidate Mohamed Morsi but legislative elections won by the Muslim Brotherhood are overturned by the courts. President Morsi tries to pushthrough a new constitution but is ousted by a military coup on 3 July 2013. The military violently represses protests against the coup and outlaws the Muslim Brotherhood. As a result, an Islamist insurgency begins in the Sinai and southern Egypt.","duration":"6.00","countryCode":"egypt"},{"country":"Equatorial Guinea","conflictType":"Complex","began":"1969.08","ended":"1979.58","eventDescription":"Following elections that brought President Macias to power in the newly independent, former Spanish colony, a crisis state of emergency was declared on March 1. A failed coup followed on March 4. President Macias used the crisis to consolidate his power and eliminate opposition leaders, ethnic-Bubi separatists, and potential rivals (ARC 2/1969-3/1969;GEN 3/1969-8/1979). Macias' reign of terror ended with a successful coup in August 1979 led by his nephew Obiang, who became chief executive.","duration":"10.50","countryCode":"equatorialguinea"},{"country":"Ethiopia","conflictType":"Complex","began":"1961.50","ended":"1993.33","eventDescription":"Eritrean secessionists led by ELF (Eritrean Liberation Front) and EPLF (Eritrean People's Liberation Front), joined by Afars, Oromos, and others in mid 1970s, fight civil wars for independence from successive imperial and Marxist regimesin Addis Ababa (ETH 7/1961-5/1991). Ethnic-Somalis in Ogaden rebel twice (ETH 10/1963-4/1964; ETH 2/1977-5/1978). In 1974, Emperor Selassie is deposed by left-wing military government and the Derg establishes repressive one-party socialist state (ARC 9/1974-3/1975). Army, internal security units, and civilian defense squads massacre political and military elites, workers, students, bureaucrats, and others thought to oppose the revolutionary regime (GEN 7/1976-12/1979). In 1975 Tigrean Liberation Front joins regional separatists in war to seize control of the central government(REV 7/1975-5/1991). Eritrean-Tigrean coalition movement defeats military-backed Derg government in May 1991; transitional government accepts Eritrean independence in May 1993 (ARC 5/1991-5/1993).","duration":"31.83","countryCode":"ethiopia"},{"country":"Ethiopia","conflictType":"Ethnic War","began":"1999.08","ended":"2000.42","eventDescription":"Border war with Eritrea provides opportunities for multiple Oromo ethnic factions, including the Oromo Liberation Front,the United Oromo Peoples Liberation Front (or Tokuchuma), the Al Ittihad, and the Islamic Oromo Liberation Front, to challenge Ethiopian government. Fighting escalates in February 1999 and again in May 1999 as Oromo factions gain support from Eritrea channeled through the Aideed faction in Somalia. Rebellion diminishes with the June 2000 cease-fire between Ethiopia and Eritrea.","duration":"1.34","countryCode":"ethiopia"},{"country":"Ethiopia","conflictType":"Ethnic War","began":"2007.00","ended":"ONGOING","eventDescription":"Ethiopia's invasion of southern Somalia in support of the transitional national government triggers a backlash in the ethnic-Somali Ogaden region. Government forces launch offensive against rebels in June 2007","duration":"10.00","countryCode":"ethiopia"},{"country":"Gambia","conflictType":"Regime Change","began":"1994.50","ended":"1994.50","eventDescription":"Longstanding multiparty system, dominated by President Dawda, is overthrown in military coup. Military rule reaffirmed with controversial elections of 1996.","duration":"0.00","countryCode":"gambia"},{"country":"Ghana","conflictType":"Regime Change","began":"1972.00","ended":"1972.00","eventDescription":"Reformist military regime permits multiparty elections. Inflation, corruption, and ethnic tension trigger military coup and suspension of party politics.","duration":"0.00","countryCode":"ghana"},{"country":"Ghana","conflictType":"Regime Change","began":"1981.92","ended":"1981.92","eventDescription":"Jerry John Rawlings leads a successful coup that ousts the ineffective, elected government led by Limann's People's National Party on December 31, 1981; Rawlings establishes personalistic rule backed by the Armed Forces Revoultionary Council (AFRC).","duration":"0.00","countryCode":"ghana"},{"country":"Guinea","conflictType":"Revolutionary War","began":"2000.67","ended":"2001.17","eventDescription":"Rebel groups attack Guinean forces in the Parrot's Beak region from bordering areas of Sierra Leone and Liberia. Rebellion is crushed in March 2001.","duration":"0.50","countryCode":"guinea"},{"country":"Guinea-Bissau","conflictType":"Complex","began":"1998.42","ended":"2003.67","eventDescription":"Civil war breaks out when President Vieira dismisses General Mane and rebel soldiers, led by Mane, attempt coup; central authority collapses coup (REV 6/1998-5/1999; ARC 6/1998-5/1999). On May 7, 1999 President Vieira and his government are ousted by rebel factions led by Gen. Mane; a transitional government is established and Yalla is elected president in January 2000. Instability persists as Gen. Mane is killed following a coup attempt in late 2000 and President Yalla is ousted in September 2003 coup led by Gen. Seabre (ARC 9/2003-9/2003).","duration":"5.25","countryCode":"guinea-bissau"},{"country":"Guinea-Bissau","conflictType":"Regime Change","began":"2012.25","ended":"2012.25","eventDescription":"Following first round presidential elections held on 18 March 2012 because of President Sanha's death from illness on 9 January 2012, military leaders seized control of the government to prevent the apparent election of former Prime Minister Carlos Gomes Junior. The military rulers set up a sham civilian administration as a cover for increasing drug trafficking.","duration":"0.00","countryCode":"guinea-bissau"},{"country":"Cote d'Ivoire","conflictType":"Complex","began":"2002.67","ended":"2011.42","eventDescription":"Tensions had remained strong since a December 1999 military coup and a subsequent attempt by coup leader Gen. Guei to thwart new elections in October 2000. An army mutiny against President Gbagbo's government in September 2002 quickly spread and polarized the country. The main rebel faction, the Patriotic Movement of Ivory Coast (MPCI), took control of the largely Muslim north and two smaller rebel factions emerged in the west. Fighting largely ends in stalemate in April 2005 with French intervention and outside mediation (ETH 9/2002-4/2005). Ouagadougou peace accords aresigned in March 2007 and establishment of a power-sharing government ends stand-off in April 2007. Disputed results of December 2010 presidential elections lead to a resumption of armed violence (REV 3/2011-4/2011). Rebel forces supporting the winning candidate in the December 2010 election, Allasane Ouattara, converge on the regime stronghold of Abidjan and capture President Gbagbo; Ouattara is installed as president in May 2011 (ARC 9/2002-6/2011).","duration":"8.75","countryCode":"coted'ivoire"},{"country":"Kenya","conflictType":"Complex","began":"1964.00","ended":"1969.75","eventDescription":"Kenya's independence ignites ethnic-Somali separatism in Northern Frontier District (ETH 1/1964-10/1966). President Kenyatta bans the opposition party (KPU), dissolves the National Assembly, and institutes one-party rule under the Kenya African National Union (KANU) (ARC 7/1969-10/1969).","duration":"5.75","countryCode":"kenya"},{"country":"Kenya","conflictType":"Ethnic War","began":"1991.75","ended":"1993.67","eventDescription":"Kalenjin and Masai supporters of the government are encouraged in attacks aimed at driving Kikuyu, Luo, and other rival groups from their villages in highlands.","duration":"1.92","countryCode":"kenya"},{"country":"Lesotho","conflictType":"Regime Change","began":"1970.00","ended":"1970.00","eventDescription":"Westminster-styled democracy brought to abrupt end after opposition wins narrow victory in first post-independence election. Prime Minister Jonathan invalidates vote, imprisons opposition leaders, dissolves parliament and assumes dictatorial powers.","duration":"0.00","countryCode":"lesotho"},{"country":"Lesotho","conflictType":"Regime Change","began":"1998.33","ended":"1999.00","eventDescription":"Mass protests against results of May 1998 elections are joined by mutiny of soldiers and shutdown of government by civil servants; foreign troops impose order and new elections are proposed.","duration":"0.67","countryCode":"lesotho"},{"country":"Liberia","conflictType":"Complex","began":"1985.83","ended":"2003.58","eventDescription":"Brig. Gen. Quiwonkpa leads the National Patriotic Front (NPF) in a failed coup against Samuel Doe following contested elections; Doe executes coup leader and targets supporters of the NPF in Monrovia (REV 11/1985). Repression bymilitary against supporters of Charles Taylor leads to widespread civil war, collapse of Monrovia government, and assassination of President Doe. National Patriotic Forces of Liberia (NPFL) and militias of rival tribally based political groups compete for control of devastated society (REV 12/1989-7/1993; ARC 9/1990-8/1996). A loose coalition offorces, Liberians United for Reconciliation and Democracy (LURD), initiate an armed rebellion in Liberia from bases in neighboring Guinea in November 2000 with the expressed aim of toppling Charles Taylor from power (REV 11/2000-8/2003). Taylor resigns and leaves country on August 11, 2003, under intense international pressure; peace agreement is signed on August 14 and transitional government is established.","duration":"17.75","countryCode":"liberia"},{"country":"Libya","conflictType":"Complex","began":"2011.08","ended":"ONGOING","eventDescription":"Encouraged by popular uprisings in neighboring Arab countries Tunisia and Egypt, protests against Col. Gaddafi's autocratic regime take place in eastern urban centers in January 2011 and quickly escalate to armed insurrection as regime forces are deployed to repress dissent (REV 2/2011-10/2011). NATO warplanes are deployed against regime armed forces and command structures in support of a UN Security Council mandate to ","duration":"5.92","countryCode":"libya"},{"country":"Madagascar","conflictType":"Regime Change","began":"2009.17","ended":"2009.17","eventDescription":"President Marc Ravalomanana resigned on 17 March 2009, following two months of popular protests against his presidency; executive power was transferred to opposition leader Andry Rajoelina who enjoyed the support of the military. The resulting 'caretaker' regime is clearly unconstitutional but its real nature remains unclear. The opposition appears muted, probably due to restrictions imposed by the military.","duration":"0.00","countryCode":"madagascar"},{"country":"Mali","conflictType":"Ethnic War","began":"1990.42","ended":"1995.00","eventDescription":"Rebellion by nomadic Tuaregs seeking regional autonomy.","duration":"4.58","countryCode":"mali"},{"country":"Mali","conflictType":"Complex","began":"2012.00","ended":"ONGOING","eventDescription":"Ethnic-Tuareg militants of the National Movement for the Liberation of Azawad (MNLA) supported by Islamist Ansar Dine militants attacked government forces in the north beginning in January 2012 and on 6 April 2012 declared an independent Islamic state in the north which subsequently fell under the control of the Ansar Dine (REV from 1/2012). A mutiny by government forces escalated to an armed coup on 22 March 2012 led by Capt. Amadou Haya Sanogo; central authority quickly collapsed, leaving Islamist forces in control of the north (ARC 3/2012-9/2013).","duration":"5.00","countryCode":"mali"},{"country":"Mauritania","conflictType":"Regime Change","began":"2008.58","ended":"2008.58","eventDescription":"On 6 August 2008, members of the Presidential Guard arrested President Abdallahi and proclaimed the formation of a military junta led by Gen. Abdelaziz.","duration":"0.00","countryCode":"mauritania"},{"country":"Morocco","conflictType":"Regime Change","began":"1965.42","ended":"1965.42","eventDescription":"King Hassan resumes full legislative and executive powers after brief experiment with limited parliamentary rule.","duration":"0.00","countryCode":"morocco"},{"country":"Morocco","conflictType":"Ethnic War","began":"1975.75","ended":"1989.83","eventDescription":"Saharawis seek independence in southwestern part of country (Western Sahara) annexed by Morocco after Spanish colonial rule ends.","duration":"14.08","countryCode":"morocco"},{"country":"Mozambique","conflictType":"Revolutionary War","began":"1976.50","ended":"1992.75","eventDescription":"Anti-Communist RENAMO (Mozambique National Resistance) rebels, supported by Rhodesia and South Africa, challenge Marxist regime, war ends with 1992 peace agreement.","duration":"16.25","countryCode":"mozambique"},{"country":"Niger","conflictType":"Regime Change","began":"1996.00","ended":"1996.00","eventDescription":"Military coup overthrows democratically elected government and suspends 1992 Constitution. Coup leader Col. Ibrahim Mainassara Barre is elected president in seriously flawed elections.","duration":"0.00","countryCode":"niger"},{"country":"Niger","conflictType":"Regime Change","began":"2009.33","ended":"2009.33","eventDescription":"President Mamadou Tandja effectively seized power in Niger on 26 May 2009 when he dissolved the National Assembly for obstructing his plan to organize a referendum to extend his rule beyond the two-term limit codified in the constitution. The referendum was held on 4 August 2009 and boycotted by the opposition; Tandja, thus, gained a “mandate” to promulgate a new constitution and stronger presidential system.","duration":"0.00","countryCode":"niger"},{"country":"Nigeria","conflictType":"Complex","began":"1964.92","ended":"1970.00","eventDescription":"Ethnic violence sparked by democratic elections triggers military coup and abandonment of state's federal structure. Counter-coup by mostly Muslim officers from north results in reestablishment of federal system (ARC 12/1964-1/1966). Counter-coup and retaliatory massacres of Ibos in north precipitate secessionist civil war by Biafra, based on Ibos of eastern region (ETH 1/1966-1/1970). In response to the Biafra separatist rebellion, the Federal government imposes a blockage on May 30, 1967, that prevents food, medical supplies, and other forms of relief assistance from reaching affected populations. Large death toll result mainly from starvation and disease caused by severe deprivation (GEN 6/1967-1/1970).","duration":"5.08","countryCode":"nigeria"},{"country":"Nigeria","conflictType":"Complex","began":"1980.92","ended":"1985.25","eventDescription":"Militant Islamic cult, the Maitatsine, battle government forces in north (REV 12/1980-4/1985). Ethnic competition, widespread corruption and electoral malpractice weaken democratic institution of Second Republic. Successful military coup bring Second Republic to an end and establishes military rule (ARC 1/1984).","duration":"4.33","countryCode":"nigeria"},{"country":"Nigeria","conflictType":"Complex","began":"2006.00","ended":"ONGOING","eventDescription":"Ethnic militias had been organized in Nigeria's Niger delta states mainly due to communal rivalries. The exploitation of oil resources in the region increased tensions and contributed to the formation of the militant Movement for the Emancipation of the Niger Delta (MEND). Systematic attacks on oil infrastructure began in January 2006. A major government offensive was launched in the area in May 2009; a government offer to reintegrate fighters was largely successful in limiting attacks in the Delta region since October 2010 (ETH 1/2006-10/2010). The emergence of 'Boko Haram' Islamic militancy in the northeast triggers a government crackdown in July 2009; militants reorganize and continue attacks (REV from 7/2009).","duration":"11.00","countryCode":"nigeria"},{"country":"Rwanda","conflictType":"Complex","began":"1963.83","ended":"1966.83","eventDescription":"Cross-border incursions by Tutsi rebels prompt local Hutu officials to orchestrate vengeance attacks and massacres by Hutus, leading to flight of 200,000 Tutsi refugees (ETH 11/1963-11/1966; GEN 12/1963-6/1964).","duration":"3.00","countryCode":"rwanda"},{"country":"Rwanda","conflictType":"Complex","began":"1990.75","ended":"2001.50","eventDescription":"Tutsi exiles of RPF launch successive attacks from Uganda prompting escalating violence between Hutu and Tutsi fighters (ETH 10/1990-12/1998). Hutu-dominated military government promises return to democratic rule, and transitional government is established. When President Habyarimana's aircraft is shot down in April 1994, Hutu government deploys military and armed gangs to systematically slaughter Tutsis and Hutu moderates (GEN 4/1994-7/1994). Ethnic-Tutsi RPF (Rwandan Patriotic Front) invades and seizes control of government by July 1994 (ARC4/1994-7/1994). Hutu militias (Inter-a-hamwe) are driven into neighboring regions, namely the DRC and Uganda, and fighting within Rwanda largely subsides by end of 1998. Hutu fighters launch a major attack in northwestern Rwanda from bases in the DRC in May 2001 but the attack is quickly crushed by the Rwandan Patriotic Army (ETH 5/2001-7/2001).","duration":"10.75","countryCode":"rwanda"},{"country":"Senegal","conflictType":"Regime Change","began":"1962.92","ended":"1963.17","eventDescription":"Increasing tensions between President Senghor and his prime minister lead to failed coup attempt by Prime Minister Dia. Senghor arrests Dia, strengthens constitutional powers of presidency, and establishes one-party rule.","duration":"0.25","countryCode":"senegal"},{"country":"Senegal","conflictType":"Ethnic War","began":"1992.67","ended":"1999.92","eventDescription":"Violence increases in Casamance region as Casamancais (MFDC) rebels intensify separatist campaign. Government talkswith Movement of Casamance Democratic Forces (MFDC) produce December 1999 ceasefire.","duration":"7.25","countryCode":"senegal"},{"country":"Sierra Leone","conflictType":"Complex","began":"1967.17","ended":"1971.25","eventDescription":"Regional factionalism within two-party democratic system triggers successful military coup after Siaka Stevens (a Limba) defeats Albert Margai (a Mende) (ARC 3/1967). President Stevens declares himself executive president and systematically restricts democratic opposition (ARC 4/1971).","duration":"4.08","countryCode":"sierraleone"},{"country":"Sierra Leone","conflictType":"Complex","began":"1991.17","ended":"2002.17","eventDescription":"Revolutionary United Front (RUF) mobilizes rural peoples, mainly Temne, in armed rebellion that devastates much of country. Various peace agreements and strong international pressure eventually lead to an end of fighting and disarmament of the RUF rebels (REV 3/1991-7/2001). Mutinous soldiers side with RUF guerrillas to overthrow President Kabbah in May 1997. Junta is defeated by ECOWAS troops in February 1998 but the new government was unable to establish central authority due to ongoing civil warfare. Mutinous soldiers side with RUF guerrillas to overthrow President Kabbah. Junta is defeated by ECOMOG in February 1998 but violence continues. Brokered peace agreement is reached between Kabbah government and RUF forces in May 2001 and State of Emergency is lifted in March 2002. (ARC 5/1997-3/2002).","duration":"11.00","countryCode":"sierraleone"},{"country":"Somalia","conflictType":"Regime Change","began":"1969.75","ended":"1969.75","eventDescription":"Increasingly autocratic style of elected government triggers clan-based violence. Military intervenes and establishes one-party socialist state.","duration":"0.00","countryCode":"somalia"},{"country":"Somalia","conflictType":"Complex","began":"1988.33","ended":"ONGOING","eventDescription":"Siad Barre regime is increasingly challenged by rebellions of Somali National Movement, based on northern Issaq clan,and United Somali Congress, based on southern Hawiye clan. The rise of Islamist militias prolonged the fighting and, in 2006, the Islamic Courts Union briefly seized control of the capital and attempted to establish an Islamic regime (ETHfrom 5/1988; REV 5/1988-8/1994). Repression and anti-insurgency operations by Barre forces cause large-scale civilian deaths (GEN 5/1988-1/1991). Barre regime collapses but chronic violence among clan-based warlords in south prevented establishment of effective central government. Combined military interventions by AU, Ethiopian, and Kenyan forces succeeded in dislodging the remaining al Shabab Islamist militants from major cities, allowing the formation of a new central government in September 2012. (ARC 1/1991-9/2012).","duration":"28.67","countryCode":"somalia"},{"country":"South Africa","conflictType":"Complex","began":"1984.58","ended":"1996.42","eventDescription":"Violent protests in black townships over poor economic conditions and lack of political rights lead to dismantling of apartheid policies and democratic elections won by ANC (African National Congress) (REV 8/1984-7/1990). Zulu Inkatha movement wars with ANC supporters for political control in Natal, initially with clandestine support from Afrikaner government's security forces (ETH 1/1987-6/1996).","duration":"11.84","countryCode":"southafrica"},{"country":"South Sudan","conflictType":"Complex","began":"2011.50","ended":"ONGOING","eventDescription":"With the country's independence, tribal rivalry between ethnic-Murle and ethnic-Nuer tribes in Jonglei state escalated into organized communal clashes. A dissident officer in the Sudan People's Liberation Army, David Yau Yau, organized a largely ethnic-Murle rebel group to challenge central authority (ETH from 7/2011). A long-standing rivalry between President Salva Kiir, an ethnic-Dinka, and Vice President Riek Machar, an ethnic-Nuer, led to the President's decision to remove Machar from office and dismiss the unity cabinet that had governed since the country's independence in July2011. Fighting between army factions loyal to the rival leaders broke out on 15 December 2013 and armed violence quickly spread across the country (ETH from 12/2013 leading to a collapse of central authority (ARC from 12/2013).","duration":"5.50","countryCode":"southsudan"},{"country":"Sudan","conflictType":"Complex","began":"1956.75","ended":"1972.17","eventDescription":"Anyanya rebellion by non-Muslim population of southern Sudan against Muslim-dominated government ends with 1972 autonomy agreement (ETH 10/1956-3/1972). Government uses indiscriminate violence against civilian Southerners thought to support secessionist movement (GEN 10/1956-3/1972). Parliamentary democracy overthrown in 1958 military coup. Constitution abrogated and opposition parties banned as General Abbud consolidates political power (ARC11/1958). Democratic government reestablished in 1964 but overthrown by leftwing military officers in 1969. Col. Numeiri establishes one-party state after failed coup by Communist elements within ruling military coalition (ARC5/1969-10/1971).","duration":"15.42","countryCode":"sudan"},{"country":"Sudan","conflictType":"Complex","began":"1983.50","ended":"ONGOING","eventDescription":"Southern rebellion resumes under SPLA (Sudan People's Liberation Army) leadership after Muslim government violates autonomy agreement; in 1991 SPLA's breakup leads to new inter-communal violence within south (ETH 7/1983-10/2002). Non-Muslim supporters of secession are targeted for destruction by indiscriminate military attacks, massacres by government-supported tribal militias, and government-induced privation and population displacement; targeting of civilian population ends in October 2002 as part of peace talks and opening of conflict areas to relief agencies (GEN9/1983-10/2002). In 1989 military overthrows democratic government after attempts to reduce the influence of religion in politics. Legislature is dissolved and non-fundamentalist parties banned as Islamic state is established (ARC 6/1989). Peace process leads to effective cease-fire in south in October 2002 and progressive agreements on power and revenue sharing. Rebellion breaks out in Darfur region in western Sudan in February 2003 followed by army offensive in March; violence quickly escalates as local Arab militias take over anti-insurgency role (ETH from 2/2003). Government backs local, Arab janjaweed militias and encourages them to terrorize suspected supporters of separatist rebels; victims groups include Fur, Zaghawa, Masaleit, and other non-Arab peoples of the Darfur region (GEN 7/2003-8/2011). With South Sudan preparing for independence in July 2011, the Sudan government ordered the disarmament of all fighters belonging to the Sudan People's Liberation Army-North (SPLA-N); these forces were concentrated in Blue Nile and South Kordofan states on the border between north and south. Leaders of the militias refused and Sudan armed forces initiated an offensive to disarm the fighters in June 2011 (ETH from 6/2011).","duration":"33.50","countryCode":"sudan"},{"country":"Swaziland","conflictType":"Regime Change","began":"1973.25","ended":"1973.25","eventDescription":"King Sobhuza dissolves parliament, outlaws all forms of political organization, and assumes all powers of government.","duration":"0.00","countryCode":"swaziland"},{"country":"Uganda","conflictType":"Complex","began":"1966.25","ended":"2006.33","eventDescription":"Allegations of corruption and persistent ethnic tensions within federal democracy leads to suspension of constitution, centralization of political authority, and creation of de facto one-party state under control of President Obote (ARC 4/1966-12/1969). A rebellion by followers of the Kabaka of Buganda breaks out in May 1966 over loss of regional autonomy and tribal prerogatives and is quickly suppressed by loyalist forces (ETH 5/1966). Gen. Idi Amin seizes power in 1971 and systematically exterminates political opponents and personal enemies. Tribes closely associated with his predecessor also are targeted (GEN 2/1971-4/1979). After Amin is overthrown by Tanzanian intervention, Obote again takes power. Following ouster of Amin, his tribal supporters begin campaign of banditry and rebellion. Langi and Acholi peoples continue rebellion with support from Sudan; December 1999 agreement between Sudan and Uganda (Nairobi Accords) ends support and rebel activity lessens for a time but reignites when Ugandan troops enter Sudan in April 2002 to attack Lord’s Resistance Army (LRA) rebel bases. Peace talks resume and an effective cease-fire is implemented in May 2006 while talks continue (ETH 10/1980-5/2006). Obote’s other political and tribal rivals are slaughtered on massive scale (GEN 12/1980-1/1986). Widespread corruption, repression, and ethnic conflict lead to overthrow of Obote's military-backed civilian regime by General Musaveni’s National Resistance Army (REV 1/1983-12/1985; ARC 7/1985-1/1986).","duration":"40.08","countryCode":"uganda"},{"country":"Zambia","conflictType":"Complex","began":"1964.50","ended":"1972.92","eventDescription":"Fighting breaks out in July 1964 when followers of the militant, anarchist Lumpa Church defy UNLP government. Clashes continue until Lumpa leaders, having voluntarily surrendered, are released in September (REV 7/1964-9/1964). Democratic institutions are weakened when political opposition to President Kaunda is restricted. Kaunda consolidates his political authority with formal establishment of one-party state (ARC 8/1968-12/1972).","duration":"8.42","countryCode":"zambia"},{"country":"Zambia","conflictType":"Regime Change","began":"1996.83","ended":"1996.83","eventDescription":"Constitutional amendments disqualify main opposition leader; President Chiluba easily wins subsequent elections.","duration":"0.00","countryCode":"zambia"},{"country":"Zimbabwe","conflictType":"Complex","began":"1972.92","ended":"1987.92","eventDescription":"White-dominated government fights black nationalists of ZAPU (Zimbabwe African People's Union) and ZANU (Zimbabwe African National Union), leading to negotiated settlement and black majority government (REV 12/1972-12/1979). Ndebele people initiate rioting and local rebellions against Shona-dominated ZANU governing coalition (ETH6/1981-12/1987). Ethnic tensions and crackdown on political opposition weaken Zimbabwe's fragile democratic institutions. Merger of ZAPU with ruling ZANU effectively establishes one-party system (ARC 12/1987).","duration":"15.00","countryCode":"zimbabwe"}]